@echo off
rem --------------------------
rem 批量保存文件、格式化磁盘1.bat
rem --------------------------

title 批量保存文件、格式化磁盘
color B0
echo -----------------------------------------
echo 开始转移文件...
pause

@echo off
:: 下行先保存当前目录，再将e:设为当前目录
pushd e:
md tmp
d:
copy *.htm e:\tmp
:: 下行恢复前次的当前目录
popd
@if exist e:\tmp\*.htm call 批量保存文件、格式化磁盘2.bat

:: 收尾工作
e:
cd tmp
del /f /s /q *.htm
cd \
rd e:\tmp

cls
color 2E
echo ---------------------磁盘格式化完成！！！-----------------------
echo ----------------------------------------------------------------
echo ----------------------------退出--------------------------------
pause